// 前言
// 对于每个滑动窗口，我们可以使用 O(k) 的时间遍历其中的每一个元素，找出其中的最大值。对于长度为 n 的数组 nums 而言，窗口的数量为 n−k+1，因此该算法的时间复杂度为 O((n−k+1)k)=O(nk)，会超出时间限制，因此我们需要进行一些优化。

// 我们可以想到，对于两个相邻（只差了一个位置）的滑动窗口，它们共用着 k−1 个元素，而只有 1 个元素是变化的。我们可以根据这个特点进行优化。

// 方法一：优先队列
// 思路与算法

// 对于「最大值」，我们可以想到一种非常合适的数据结构，那就是优先队列（堆），其中的大根堆可以帮助我们实时维护一系列元素中的最大值。

// 对于本题而言，初始时，我们将数组 nums 的前 k 个元素放入优先队列中。每当我们向右移动窗口时，我们就可以把一个新的元素放入优先队列中，此时堆顶的元素就是堆中所有元素的最大值。然而这个最大值可能并不在滑动窗口中，在这种情况下，这个值在数组 nums 中的位置出现在滑动窗口左边界的左侧。因此，当我们后续继续向右移动窗口时，这个值就永远不可能出现在滑动窗口中了，我们可以将其永久地从优先队列中移除。

// 我们不断地移除堆顶的元素，直到其确实出现在滑动窗口中。此时，堆顶元素就是滑动窗口中的最大值。为了方便判断堆顶元素与滑动窗口的位置关系，我们可以在优先队列中存储二元组 (num,index)，表示元素 num 在数组中的下标为 index。

class Solution 
{
public:
    vector<int> maxSlidingWindow(vector<int>& nums, int k) 
	{
        int n = nums.size();	// 获取数组nums的总长度n
		
        priority_queue<pair<int, int>> q;	// 定义大顶堆，存pair(数值, 下标)，堆顶永远是最大值
		
        for (int i = 0; i < k; ++i) // 先把第一个窗口的k个元素全部入堆
		{
            q.emplace(nums[i], i);	// 将元素值nums[i]和它的下标i，加入堆q
        }
		
        vector<int> ans = {q.top().first};	// 第一个窗口的最大值是堆顶元素，存入答案数组
		
        for (int i = k; i < n; ++i) // i是窗口右边界，从第k个元素开始遍历剩下所有元素
		{
            q.emplace(nums[i], i);	// 把当前新窗口右端点元素加入堆
			
            while (q.top().second <= i - k) // 判断堆顶元素下标是否已经滑出窗口左边界之外
			{
                q.pop();	// 如果过期，弹出这个失效的最大值
            }
			
            ans.push_back(q.top().first);	// 清理完过期元素后，堆顶就是当前窗口最大值，加入ans
        }
		
        return ans;	// 返回保存所有窗口最大值的结果数组
    }
};

// 复杂度分析

// 时间复杂度：O(nlogn)，其中 n 是数组 nums 的长度。在最坏情况下，数组 nums 中的元素单调递增，那么最终优先队列中包含了所有元素，没有元素被移除。由于将一个元素放入优先队列的时间复杂度为 O(logn)，因此总时间复杂度为 O(nlogn)。

// 空间复杂度：O(n)，即为优先队列需要使用的空间。这里所有的空间复杂度分析都不考虑返回的答案需要的 O(n) 空间，只计算额外的空间使用。