// 方法一：排序
// 思路

// 如果我们按照区间的左端点排序，那么在排完序的列表中，可以合并的区间一定是连续的。如下图所示，标记为蓝色、黄色和绿色的区间分别可以合并成一个大区间，它们在排完序的列表中是连续的

// 算法

// 我们用数组 merged 存储最终的答案。

// 首先，我们将列表中的区间按照左端点升序排序。然后我们将第一个区间加入 merged 数组中，并按顺序依次考虑之后的每个区间：

// 如果当前区间的左端点在数组 merged 中最后一个区间的右端点之后，那么它们不会重合，我们可以直接将这个区间加入数组 merged 的末尾；

// 否则，它们重合，我们需要用当前区间的右端点更新数组 merged 中最后一个区间的右端点，将其置为二者的较大值。

// 正确性证明

// 上述算法的正确性可以用反证法来证明：在排完序后的数组中，两个本应合并的区间没能被合并，那么说明存在这样的三元组 (i,j,k) 以及数组中的三个区间 a[i],a[j],a[k] 满足 i<j<k 并且 (a[i],a[k]) 可以合并，但 (a[i],a[j]) 和 (a[j],a[k]) 不能合并。这说明它们满足下面的不等式：

// a[i].end<a[j].start(a[i] 和 a[j] 不能合并)
// a[j].end<a[k].start(a[j] 和 a[k] 不能合并)
// a[i].end≥a[k].start(a[i] 和 a[k] 可以合并)
// 我们联立这些不等式（注意还有一个显然的不等式 a[j].start≤a[j].end），可以得到：

// a[i].end<a[j].start≤a[j].end<a[k].start
// 产生了矛盾！这说明假设是不成立的。因此，所有能够合并的区间都必然是连续的。

class Solution 
{
public:
    vector<vector<int>> merge(vector<vector<int>>& intervals) 
	{
        if (intervals.size() == 0) // 如果区间数组为空
		{
            return {};	// 直接返回空
        }
		
        sort(intervals.begin(), intervals.end());	// 按区间左端点从小到大排序
		
        vector<vector<int>> merged;	// 存放合并完成后的区间结果
		
        for (int i = 0; i < intervals.size(); ++i) // 逐个遍历每一个区间
		{
            int L = intervals[i][0], R = intervals[i][1];	// L当前区间左边界，R当前区间右边界
			
            if (!merged.size() || merged.back()[1] < L) 
			{
				// 结果数组为空 或者 结果里最后一个区间的右端 < 当前区间左端点 → 两个区间不重叠
                merged.push_back({L, R});
            }
            else 
			{
				// 区间重叠了，更新结果里最后一个区间的右端，取更大的那个右边界
                merged.back()[1] = max(merged.back()[1], R);
            }
        }
		
        return merged;	// 返回合并后的区间
    }
};


// # 举例子：输入 `intervals = [[1,3],[2,6],[8,10],[15,18]]`

// 1. 先 sort 排序，本例子本来已经有序：`[[1,3],[2,6],[8,10],[15,18]]`
// 2. `merged`初始是空

// - i=0，L=1,R=3
// merged 为空 → 推入`[1,3]`，merged = `[[1,3]]`
// - i=1，L=2,R=6
// merged 最后区间右端是 3，3 不小于 2，区间重叠
// 更新最后区间右端 `max(3,6)=6` → merged = `[[1,6]]`
// - i=2，L=8,R=10
// merged 最后右端是 6，6 < 8，不重叠，直接推入`[8,10]`，merged = `[[1,6],[8,10]]`
// - i=3，L=15,R=18
// merged 最后右端是 10，10 <15，不重叠，推入`[15,18]`

// 3. 最终返回结果：`[[1,6],[8,10],[15,18]]`

// 复杂度分析

// 时间复杂度：O(nlogn)，其中 n 为区间的数量。除去排序的开销，我们只需要一次线性扫描，所以主要的时间开销是排序的 O(nlogn)。

// 空间复杂度：O(logn)，其中 n 为区间的数量。这里计算的是存储答案之外，使用的额外空间。O(logn) 即为排序所需要的空间复杂度。