// 前言
// 如果本题没有额外的时空复杂度要求，那么就很容易实现：

// 我们可以将数组所有的数放入哈希表，随后从 1 开始依次枚举正整数，并判断其是否在哈希表中；

// 我们可以从 1 开始依次枚举正整数，并遍历数组，判断其是否在数组中。

// 如果数组的长度为 N，那么第一种做法的时间复杂度为 O(N)，空间复杂度为 O(N)；第二种做法的时间复杂度为 O(N 
// 2
 // )，空间复杂度为 O(1)。但它们都不满足时间复杂度为 O(N) 且空间复杂度为 O(1)。

// 「真正」满足时间复杂度为 O(N) 且空间复杂度为 O(1) 的算法是不存在的，但是我们可以退而求其次：利用给定数组中的空间来存储一些状态。也就是说，如果题目给定的数组是不可修改的，那么就不存在满足时空复杂度要求的算法；但如果我们可以修改给定的数组，那么是存在满足要求的算法的。

// 方法一：哈希表
// 对于「前言」中提到的第一种做法：

// 我们可以将数组所有的数放入哈希表，随后从 1 开始依次枚举正整数，并判断其是否在哈希表中。

// 仔细想一想，我们为什么要使用哈希表？这是因为哈希表是一个可以支持快速查找的数据结构：给定一个元素，我们可以在 O(1) 的时间查找该元素是否在哈希表中。因此，我们可以考虑将给定的数组设计成哈希表的「替代产品」。

// 实际上，对于一个长度为 N 的数组，其中没有出现的最小正整数只能在 [1,N+1] 中。这是因为如果 [1,N] 都出现了，那么答案是 N+1，否则答案是 [1,N] 中没有出现的最小正整数。这样一来，我们将所有在 [1,N] 范围内的数放入哈希表，也可以得到最终的答案。而给定的数组恰好长度为 N，这让我们有了一种将数组设计成哈希表的思路：

// 我们对数组进行遍历，对于遍历到的数 x，如果它在 [1,N] 的范围内，那么就将数组中的第 x−1 个位置（注意：数组下标从 0 开始）打上「标记」。在遍历结束之后，如果所有的位置都被打上了标记，那么答案是 N+1，否则答案是最小的没有打上标记的位置加 1。

// 那么如何设计这个「标记」呢？由于数组中的数没有任何限制，因此这并不是一件容易的事情。但我们可以继续利用上面的提到的性质：由于我们只在意 [1,N] 中的数，因此我们可以先对数组进行遍历，把不在 [1,N] 范围内的数修改成任意一个大于 N 的数（例如 N+1）。这样一来，数组中的所有数就都是正数了，因此我们就可以将「标记」表示为「负号」。算法的流程如下：

// 我们将数组中所有小于等于 0 的数修改为 N+1；

// 我们遍历数组中的每一个数 x，它可能已经被打了标记，因此原本对应的数为 ∣x∣，其中 ∣∣ 为绝对值符号。如果 ∣x∣∈[1,N]，那么我们给数组中的第 ∣x∣−1 个位置的数添加一个负号。注意如果它已经有负号，不需要重复添加；

// 在遍历完成之后，如果数组中的每一个数都是负数，那么答案是 N+1，否则答案是第一个正数的位置加 1。

class Solution 
{
public:
    int firstMissingPositive(vector<int>& nums) 
	{
        int n = nums.size();	// 获取数组长度n
		
		// 遍历数组，把所有小于等于0的负数、0全部改成n+1（不再参与标记）
        for (int& num: nums) 
		{
            if (num <= 0) 
			{
                num = n + 1;
            }
        }
		
		// 第二轮遍历：用负号做标记，表示该位置对应的正整数存在
        for (int i = 0; i < n; ++i) 
		{
            int num = abs(nums[i]);	// 取当前数字绝对值，防止已经被取负影响读取
			
            if (num <= n) // 只关心1~n范围内的数，大于n不用标记
			{
                nums[num - 1] = -abs(nums[num - 1]);
            }
        }
		
		// 第三轮遍历，找第一个正数，下标i对应数字i+1，就是缺失的最小正整数
        for (int i = 0; i < n; ++i) 
		{
            if (nums[i] > 0) 
			{
                return i + 1;
            }
        }
		
		// 1~n全都存在，缺失的最小正整数就是n+1
        return n + 1;
    }
};

// # 样例：nums = [3,4,-1,1]，n=4

// 目标：找出缺失的最小正整数，答案应该是 2

// ### 第一轮循环：把 ≤0 的数改成 n+1=5

// 原始数组：`[3, 4, -1, 1]`

// - i=0，num=3：>0，不变
// - i=1，num=4：>0，不变
// - i=2，num=-1：≤0 → 修改成 5
// - i=3，num=1：>0，不变

// 第一轮结束数组：**[3, 4, 5, 1]**

// ---

// ### 第二轮循环：打负标记（标记数字是否存在）

// > 
// > 规则：数字 num 存在，就把下标 `num-1` 的位置变为负数

// - i=0，num = abs (3)=3。3 ≤4
// 下标`3-1=2`，nums [2] = -abs (nums [2]) → nums [2] = -5
// 数组现在：`[3, 4, -5, 1]`
// - i=1，num = abs (4)=4。4 ≤4
// 下标`4-1=3`，nums [3] = -abs (nums [3]) → nums [3] = -1
// 数组现在：`[3, 4, -5, -1]`
// - i=2，num = abs (-5)=5。5>4，跳过，不操作
// 数组不变：`[3, 4, -5, -1]`
// - i=3，num = abs (-1)=1。1 ≤4
// 下标`1-1=0`，nums [0] = -abs (nums [0]) → nums [0] = -3
// 数组现在：**[-3, 4, -5, -1]**

// 第二轮结束数组：**[-3, 4, -5, -1]**

// ---

// ### 第三轮循环：找第一个大于 0 的位置

// - i=0，nums [0]=-3 负数 → 代表数字 1 存在
// - i=1，nums [1]=4 正数 ✅ → 代表数字**i+1=2 不存在**
// return `i+1 = 2`

// 最终结果：2 ✔

// 复杂度分析

// 时间复杂度：O(N)，其中 N 是数组的长度。

// 空间复杂度：O(1)。