// 方法一：使用辅助数组
// 我们以题目中的示例二

// 作为例子，分析将图像旋转 90 度之后，这些数字出现在什么位置。

// 对于矩阵中的第一行而言，在旋转后，它出现在倒数第一列的位置：
 
// 旋转后

// 并且，第一行的第 x 个元素在旋转后恰好是倒数第一列的第 x 个元素。

// 对于矩阵中的第二行而言，在旋转后，它出现在倒数第二列的位置：
 
// 旋转后

// 对于矩阵中的第三行和第四行同理。这样我们可以得到规律：

// 对于矩阵中第 i 行的第 j 个元素，在旋转后，它出现在倒数第 i 列的第 j 个位置。

// 我们将其翻译成代码。由于矩阵中的行列从 0 开始计数，因此对于矩阵中的元素 matrix[row][col]，在旋转后，它的新位置为 matrix new[col][n−row−1]。

// 这样以来，我们使用一个与 matrix 大小相同的辅助数组 matrix new ，临时存储旋转后的结果。我们遍历 matrix 中的每一个元素，根据上述规则将该元素存放到 matrix new 中对应的位置。在遍历完成之后，再将 matrix new 中的结果复制到原数组中即可。

class Solution 
{
public:
    void rotate(vector<vector<int>>& matrix) 
	{
        int n = matrix.size();	// 获取方阵的边长n（n行n列）
		
        // C++ 这里的 = 拷贝是值拷贝，会得到一个新的数组
        auto matrix_new = matrix;
		
        for (int i = 0; i < n; ++i) 	// 外层循环：遍历原矩阵的每一行i
		{
            for (int j = 0; j < n; ++j) // 内层循环：遍历原矩阵的每一列j
			{
				// 原位置(i,j)的元素，旋转90度后，放到新矩阵 [j][n-i-1] 的位置
                matrix_new[j][n - i - 1] = matrix[i][j];
            }
        }
		
        // 这里也是值拷贝, 将旋转完成的新矩阵，整体赋值覆盖原来的matrix
        matrix = matrix_new;
    }
};

// 复杂度分析

// 时间复杂度：O(N 2)，其中 N 是 matrix 的边长。

// 空间复杂度：O(N 2)。我们需要使用一个和 matrix 大小相同的辅助数组。