// 方法一：将值复制到数组中后用双指针法
// 思路

// 如果你还不太熟悉链表，下面有关于列表的概要讲述。

// 有两种常用的列表实现，分别为数组列表和链表。如果我们想在列表中存储值，它们是如何实现的呢？

// 数组列表底层是使用数组存储值，我们可以通过索引在 O(1) 的时间访问列表任何位置的值，这是由基于内存寻址的方式。
// 链表存储的是称为节点的对象，每个节点保存一个值和指向下一个节点的指针。访问某个特定索引的节点需要 O(n) 的时间，因为要通过指针获取到下一个位置的节点。
// 确定数组列表是否回文很简单，我们可以使用双指针法来比较两端的元素，并向中间移动。一个指针从起点向中间移动，另一个指针从终点向中间移动。这需要 O(n) 的时间，因为访问每个元素的时间是 O(1)，而有 n 个元素要访问。

// 然而同样的方法在链表上操作并不简单，因为不论是正向访问还是反向访问都不是 O(1)。而将链表的值复制到数组列表中是 O(n)，因此最简单的方法就是将链表的值复制到数组列表中，再使用双指针法判断。

// 算法

// 一共为两个步骤：

// 复制链表值到数组列表中。
// 使用双指针法判断是否为回文。
// 第一步，我们需要遍历链表将值复制到数组列表中。我们用 currentNode 指向当前节点。每次迭代向数组添加 currentNode.val，并更新 currentNode = currentNode.next，当 currentNode = null 时停止循环。

// 执行第二步的最佳方法取决于你使用的语言。在 Python 中，很容易构造一个列表的反向副本，也很容易比较两个列表。而在其他语言中，就没有那么简单。因此最好使用双指针法来检查是否为回文。我们在起点放置一个指针，在结尾放置一个指针，每一次迭代判断两个指针指向的元素是否相同，若不同，返回 false；相同则将两个指针向内移动，并继续判断，直到两个指针相遇。

// 在编码的过程中，注意我们比较的是节点值的大小，而不是节点本身。正确的比较方式是：node_1.val == node_2.val，而 node_1 == node_2 是错误的。

class Solution 
{
public:
    bool isPalindrome(ListNode* head) 
	{
        vector<int> vals;	// 创建一个动态数组，用来存放链表所有节点的值
		
        while (head != nullptr) // 循环：只要当前节点不为空，就继续遍历
		{
            vals.emplace_back(head->val);	// 把当前节点的值存入数组
			
            head = head->next;	// head移动到下一个节点
        }
		
		// i从左往右，j从右往左；i<j时继续比对
        for (int i = 0, j = (int)vals.size() - 1; i < j; ++i, --j) 
		{
            if (vals[i] != vals[j]) // 左右位置的值不相等，不是回文
			{
                return false;	// 直接返回false
            }
        }
		
        return true;	// 全部比对完成，都相等，是回文
    }
};

// 复杂度分析

// 时间复杂度：O(n)，其中 n 指的是链表的元素个数。
// 第一步： 遍历链表并将值复制到数组中，O(n)。
// 第二步：双指针判断是否为回文，执行了 O(n/2) 次的判断，即 O(n)。
// 总的时间复杂度：O(2n)=O(n)。
// 空间复杂度：O(n)，其中 n 指的是链表的元素个数，我们使用了一个数组列表存放链表的元素值。