// 方法一：哈希表
// 思路及算法

// 最容易想到的方法是遍历所有节点，每次遍历到一个节点时，判断该节点此前是否被访问过。

// 具体地，我们可以使用哈希表来存储所有已经访问过的节点。每次我们到达一个节点，如果该节点已经存在于哈希表中，则说明该链表是环形链表，否则就将该节点加入哈希表中。重复这一过程，直到我们遍历完整个链表即可。

class Solution 
{
public:
	// 判断链表是否有环，有环返回true，无环返回false
    bool hasCycle(ListNode *head) 
	{
        unordered_set<ListNode*> seen;	// 创建哈希集合，存放遍历过的链表节点指针
		
        while (head != nullptr) // 当前节点不为空，继续循环遍历
		{
            if (seen.count(head)) // 检查集合里有没有当前这个节点指针
			{
                return true;	// 找到了，说明之前访问过，链表存在环
            }
            seen.insert(head);	// 把当前节点指针存入集合，标记已经访问
			
            head = head->next;	// 移动到下一个节点，继续遍历
        }
		
        return false;	// 循环结束走到空节点，链表没有环
    }
};

// 复杂度分析

// 时间复杂度：O(N)，其中 N 是链表中的节点数。最坏情况下我们需要遍历每个节点一次。

// 空间复杂度：O(N)，其中 N 是链表中的节点数。主要为哈希表的开销，最坏情况下我们需要将每个节点插入到哈希表中一次。