// 前言
// 在对链表进行操作时，一种常用的技巧是添加一个哑节点（dummy node），它的 next 指针指向链表的头节点。这样一来，我们就不需要对头节点进行特殊的判断了。

// 例如，在本题中，如果我们要删除节点 y，我们需要知道节点 y 的前驱节点 x，并将 x 的指针指向 y 的后继节点。但由于头节点不存在前驱节点，因此我们需要在删除头节点时进行特殊判断。但如果我们添加了哑节点，那么头节点的前驱节点就是哑节点本身，此时我们就只需要考虑通用的情况即可。

// 特别地，在某些语言中，由于需要自行对内存进行管理。因此在实际的面试中，对于「是否需要释放被删除节点对应的空间」这一问题，我们需要和面试官进行积极的沟通以达成一致。下面的代码中默认不释放空间。

// 方法一：计算链表长度
// 思路与算法

// 一种容易想到的方法是，我们首先从头节点开始对链表进行一次遍历，得到链表的长度 L。随后我们再从头节点开始对链表进行一次遍历，当遍历到第 L−n+1 个节点时，它就是我们需要删除的节点。

// 为了与题目中的 n 保持一致，节点的编号从 1 开始，头节点为编号 1 的节点。

// 为了方便删除操作，我们可以从哑节点开始遍历 L−n+1 个节点。当遍历到第 L−n+1 个节点时，它的下一个节点就是我们需要删除的节点，这样我们只需要修改一次指针，就能完成删除操作。

class Solution 
{
public:
	// 函数：计算链表的长度，传入链表头节点head
    int getLength(ListNode* head) 
	{
        int length = 0;	// 定义长度变量，初始化为0
		
        while (head) // 循环：head不为空就继续遍历
		{
            ++length;	// 长度+1
			
            head = head->next;	// head移动到下一个节点
        }
		
        return length;	// 返回链表总长度
    }

	// 函数：删除链表倒数第 n 个节点，返回新链表头节点
    ListNode* removeNthFromEnd(ListNode* head, int n) 
	{
        ListNode* dummy = new ListNode(0, head);	// 创建哑节点dummy，哑节点next指向head，用来处理要删除头节点的边界情况
		
        int length = getLength(head);	// 调用上面函数，获取链表总长度
		
        ListNode* cur = dummy;	// cur指针从哑节点开始出发
		
		// 循环：找到待删除节点的【前一个节点】
        for (int i = 1; i < length - n + 1; ++i)
		{
            cur = cur->next;	// cur向后移动
        }
		
        cur->next = cur->next->next;	// 跳过目标节点，即删除cur->next节点
		
        ListNode* ans = dummy->next;	// 保存新链表的头节点（哑节点后面的节点）
		
        delete dummy;	// 释放哑节点内存，防止内存泄漏
		
        return ans;	// 返回新链表头
    }
};

// 复杂度分析

// 时间复杂度：O(L)，其中 L 是链表的长度。

// 空间复杂度：O(1)。