// 方法一：深度优先搜索
// 思路与算法

// 如果我们知道了左子树和右子树的最大深度 l 和 r，那么该二叉树的最大深度即为

// max(l,r)+1
// 而左子树和右子树的最大深度又可以以同样的方式进行计算。因此我们可以用「深度优先搜索」的方法来计算二叉树的最大深度。具体而言，在计算当前二叉树的最大深度时，可以先递归计算出其左子树和右子树的最大深度，然后在 O(1) 时间内计算出当前二叉树的最大深度。递归在访问到空节点时退出。

class Solution 
{
public:
    int maxDepth(TreeNode* root) 
	{
		// 如果当前节点是空节点，深度为0，递归终止
        if (root == nullptr) return 0;
		
		// 递归求左子树深度、右子树深度，取较大值，再加当前节点这一层(+1)
        return max(maxDepth(root->left), maxDepth(root->right)) + 1;
    }
};

// 复杂度分析

// 时间复杂度：O(n)，其中 n 为二叉树节点的个数。每个节点在递归中只被遍历一次。

// 空间复杂度：O(height)，其中 height 表示二叉树的高度。递归函数需要栈空间，而栈空间取决于递归的深度，因此空间复杂度等价于二叉树的高度。

// 方法二：广度优先搜索
// 思路与算法

// 我们也可以用「广度优先搜索」的方法来解决这道题目，但我们需要对其进行一些修改，此时我们广度优先搜索的队列里存放的是「当前层的所有节点」。每次拓展下一层的时候，不同于广度优先搜索的每次只从队列里拿出一个节点，我们需要将队列里的所有节点都拿出来进行拓展，这样能保证每次拓展完的时候队列里存放的是当前层的所有节点，即我们是一层一层地进行拓展，最后我们用一个变量 ans 来维护拓展的次数，该二叉树的最大深度即为 ans。

class Solution 
{
public:
    int maxDepth(TreeNode* root) 
	{
		// 空节点，深度直接为0
        if (root == nullptr) return 0;
		
		// 创建队列，用于层序遍历（BFS）
        queue<TreeNode*> Q;
		
		// 把根节点入队
        Q.push(root);
		
		// 记录最终的深度（层数）
        int ans = 0;
		
		// 队列不为空，说明还有节点没有遍历
        while (!Q.empty()) 
		{
			// 获取当前这一层一共有多少个节点
            int sz = Q.size();
			
			// 循环处理当前层的所有节点
            while (sz > 0) 
			{
				// 取出队首节点
                TreeNode* node = Q.front();
				
				// 取出队首节点再删除
				Q.pop();
				
				// 如果左孩子存在，左孩子入队（下一层）
                if (node->left) Q.push(node->left);
				
				// 如果右孩子存在，右孩子入队（下一层）
                if (node->right) Q.push(node->right);
				
				// 当前层待处理节点数减一
                sz -= 1;
            }
			
			// 一层遍历完成，深度+1
            ans += 1;
        } 
		
		// 返回总层数，也就是二叉树最大深度
        return ans;
    }
};

// 复杂度分析

// 时间复杂度：O(n)，其中 n 为二叉树的节点个数。与方法一同样的分析，每个节点只会被访问一次。

// 空间复杂度：此方法空间的消耗取决于队列存储的元素数量，其在最坏情况下会达到 O(n)。