// 方法一：中序遍历
// 预备知识

// 二叉搜索树具有如下性质：

// 节点的左子树只包含小于当前节点的数。

// 节点的右子树只包含大于当前节点的数。

// 所有左子树和右子树自身必须也是二叉搜索树。

// 二叉树的中序遍历即按照访问左子树——根节点——右子树的方式遍历二叉树；在访问其左子树和右子树时，我们也按照同样的方式遍历；直到遍历完整棵树。

// 思路和算法

// 因为二叉搜索树和中序遍历的性质，所以二叉搜索树的中序遍历是按照键增加的顺序进行的。于是，我们可以通过中序遍历找到第 k 个最小元素。

// 「二叉树的中序遍历」可以参考「94. 二叉树的中序遍历的官方题解」，具体地，我们使用迭代方法，这样可以在找到答案后停止，不需要遍历整棵树。

class Solution 
{
public:
	// 寻找二叉搜索树中第k小的元素
    int kthSmallest(TreeNode* root, int k) 
	{
        stack<TreeNode *> stack;	// 栈，用来迭代实现中序遍历
		
        while (root != nullptr || stack.size() > 0) // 根不为空 或者 栈里还有节点就继续循环
		{
            while (root != nullptr) // 一直往左走到最左叶子
			{
                stack.push(root);	// 节点压入栈
				
                root = root->left;	// 继续访问左孩子
            }
			
            root = stack.top();	// 取出栈顶节点
			
            stack.pop();	// 栈顶节点弹出
			
            --k;	// 找到一个有序元素，k减1
			
            if (k == 0) // k减到0，说明这就是第k小的数
			{
                break;
            }
			
            root = root->right;	// 去访问右子树
        }
		
        return root->val;	// 返回第k小节点的值
    }
};

// 复杂度分析

// 时间复杂度：O(H+k)，其中 H 是树的高度。在开始遍历之前，我们需要 O(H) 到达叶节点。当树是平衡树时，时间复杂度取得最小值 O(logN+k)；当树是线性树（树中每个节点都只有一个子节点或没有子节点）时，时间复杂度取得最大值 O(N+k)。

// 空间复杂度：O(H)，栈中最多需要存储 H 个元素。当树是平衡树时，空间复杂度取得最小值 O(logN)；当树是线性树时，空间复杂度取得最大值 O(N)。