// 方法一：递归
// 思路和算法

// 我们递归遍历整棵二叉树，定义 f 
// x
// ​
  // 表示 x 节点的子树中是否包含 p 节点或 q 节点，如果包含为 true，否则为 false。那么符合条件的最近公共祖先 x 一定满足如下条件：

// (f 
// lson
// ​
 //  && f 
// rson
// ​
 // ) ∣∣ (x = p ∣∣ x = q)
// 其中 lson 和 rson 分别代表 x 节点的左孩子和右孩子。初看可能会感觉条件判断有点复杂，我们来一条条看，f 
// lson
// ​
 //  && f 
// rson
// ​
  // 说明左子树和右子树均包含 p 节点或 q 节点，如果左子树包含的是 p 节点，那么右子树只能包含 q 节点，反之亦然，因为 p 节点和 q 节点都是不同且唯一的节点，因此如果满足这个判断条件即可说明 x 就是我们要找的最近公共祖先。再来看第二条判断条件，如果 x 恰好是 p 节点或 q 节点，那么当另一个节点位于 x 的子树中时，x 就是我们要找的最近公共祖先；如果另一个节点位于 x 的子树之外，后续遍历到的祖先会通过第一条判断条件更新答案。

// 你可能会疑惑这样找出来的公共祖先深度是否是最大的。其实是最大的，因为我们是自底向上从叶子节点开始更新的，所以在所有满足条件的公共祖先中一定是深度最大的祖先先被访问到，且由于 f 
// x
// ​
  // 本身的定义很巧妙，在找到最近公共祖先 x 以后，f 
// x
// ​
  // 按定义被设置为 true ，即假定了这个子树中只有一个 p 节点或 q 节点，因此其他公共祖先不会再被判断为符合条件。

// 下图展示了一个示例，搜索树中两个节点 9 和 11 的最近公共祖先。

class Solution 
{
public:
    TreeNode* ans;	// 用来保存最终找到的最近公共祖先节点
	
    bool dfs(TreeNode* root, TreeNode* p, TreeNode* q) 
	{
        if (root == nullptr) return false;	// 空节点，返回false，代表这一分支没有p或者q
		
        bool lson = dfs(root->left, p, q);	// 递归搜索左子树，看左子树是否包含p/q
		
        bool rson = dfs(root->right, p, q);	// 递归搜索右子树，看右子树是否包含p/q
		
		// 两种情况：1.左、右子树一边找到p、一边找到q；2.当前节点本身就是p或者q
        if ((lson && rson) || (root->val == p->val || root->val == q->val)) 
		{
            ans = root;	// 满足条件，当前节点就是公共祖先，记录下来
        }
		
		// 返回true：左子树有 或者 右子树有 或者 当前节点就是p/q
        return lson || rson || (root->val == p->val || root->val == q->val);
    }
	
    TreeNode* lowestCommonAncestor(TreeNode* root, TreeNode* p, TreeNode* q) 
	{
        dfs(root, p, q);	// 启动深度优先搜索
		
        return ans;	// 返回找到的最近公共祖先
    }
};

复杂度分析

时间复杂度：O(N)，其中 N 是二叉树的节点数。二叉树的所有节点有且只会被访问一次，因此时间复杂度为 O(N)。

空间复杂度：O(N) ，其中 N 是二叉树的节点数。递归调用的栈深度取决于二叉树的高度，二叉树最坏情况下为一条链，此时高度为 N，因此空间复杂度为 O(N)。