// 方法一：滑动窗口
// 思路

// 根据题目要求，我们需要在字符串 s 寻找字符串 p 的异位词。因为字符串 p 的异位词的长度一定与字符串 p 的长度相同，所以我们可以在字符串 s 中构造一个长度为与字符串 p 的长度相同的滑动窗口，并在滑动中维护窗口中每种字母的数量；当窗口中每种字母的数量与字符串 p 中每种字母的数量相同时，则说明当前窗口为字符串 p 的异位词。

// 算法

// 在算法的实现中，我们可以使用数组来存储字符串 p 和滑动窗口中每种字母的数量。

// 细节

// 当字符串 s 的长度小于字符串 p 的长度时，字符串 s 中一定不存在字符串 p 的异位词。但是因为字符串 s 中无法构造长度与字符串 p 的长度相同的窗口，所以这种情况需要单独处理。

class Solution 
{
public:
    vector<int> findAnagrams(string s, string p) 
	{
        int sLen = s.size(), pLen = p.size();	// 获取字符串s和p的长度

        if (sLen < pLen) // 如果s比p短，不可能存在异位词，直接返回空数组
		{
            return vector<int>();
        }

        vector<int> ans;	// 存放所有符合条件的起始下标
		
        vector<int> sCount(26);	// 统计s窗口内26个小写字母出现次数
        vector<int> pCount(26);	// 统计模式串p的26个小写字母出现次数
		
        for (int i = 0; i < pLen; ++i) 
		{
            ++sCount[s[i] - 'a'];	// s[i]-'a'把字母转为0~25下标，计数+1
			
            ++pCount[p[i] - 'a'];	// 统计p串对应字母计数
        }

        if (sCount == pCount) // 判断第一个窗口是否是异位词
		{
            ans.emplace_back(0);	// 是异位词，把起点0加入结果
        }

        for (int i = 0; i < sLen - pLen; ++i) // 滑动窗口，逐个向右移动窗口
		{
            --sCount[s[i] - 'a'];	// 移出窗口最左侧旧字符，计数减1
			
            ++sCount[s[i + pLen] - 'a'];	// 窗口右侧新增字符，计数加1

            if (sCount == pCount) // 当前窗口字母频次和p完全相同，是异位词
			{
                ans.emplace_back(i + 1);	// 存入当前窗口起始下标
            }
        }

        return ans;	// 返回全部异位词起始下标
    }
};

// 复杂度分析

// 时间复杂度：O(m+(n−m)×Σ)，其中 n 为字符串 s 的长度，m 为字符串 p 的长度，Σ 为所有可能的字符数。我们需要 O(m) 来统计字符串 p 中每种字母的数量；需要 O(m) 来初始化滑动窗口；需要判断 n−m+1 个滑动窗口中每种字母的数量是否与字符串 p 中每种字母的数量相同，每次判断需要 O(Σ) 。因为 s 和 p 仅包含小写字母，所以 Σ=26。

// 空间复杂度：O(Σ)。用于存储字符串 p 和滑动窗口中每种字母的数量。